In [1]:
from mftool import Mftool
import pandas as pd

mf = Mftool()

equity = ["0P0000XW51", "0P0000XW4V", "0P0000XW4E"]
debt = []
hybrid = []
temp_list = []
for fund in equity:
    temp_list.append(mf.history(fund,start='2018-08-29',end='2023-08-29',as_dataframe=True))

equity_dfs = dict(zip(equity, temp_list))

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed

In [38]:
equity_dfs['0P0000XW9N']

                  nav  dayChange
date
29-08-2018  56.935200        NaN
30-08-2018  57.033798   0.098598
31-08-2018  57.325100   0.291302
03-09-2018  57.248798  -0.076302
04-09-2018  56.075699  -1.173100
...               ...        ...
21-11-2022  89.631599  -0.145004
22-11-2022  89.263199  -0.368401
23-11-2022  89.737701   0.474503
24-11-2022  90.252701   0.514999
25-11-2022  90.736801   0.484100

[1022 rows x 2 columns]

In [2]:
for fund in equity:
    equity_dfs[fund].reset_index(inplace=True)
    equity_dfs[fund].drop(columns='dayChange',inplace=True)
    equity_dfs[fund].dropna()

In [3]:
for fund in equity:
    print(equity_dfs[fund].shape)

(1228, 2)
(1228, 2)
(1229, 2)

In [4]:
temp_df = equity_dfs

In [5]:
for fund in equity:
    temp_df[fund]["date"] = pd.to_datetime(temp_df[fund]["date"])

C:\Users\Admin\AppData\Local\Temp\ipykernel_8344\3706023477.py:2: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  temp_df[fund]["date"] = pd.to_datetime(temp_df[fund]["date"])
C:\Users\Admin\AppData\Local\Temp\ipykernel_8344\3706023477.py:2: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  temp_df[fund]["date"] = pd.to_datetime(temp_df[fund]["date"])
C:\Users\Admin\AppData\Local\Temp\ipykernel_8344\3706023477.py:2: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  temp_df[fund]["date"] = pd.to_datetime(temp_df[fund]["date"])

In [7]:
for fund in equity:
    temp_df[fund] = temp_df[fund].dropna()

In [6]:
temp_df

{'0P0000XW51':            date         nav
 0    2018-08-29   98.234497
 1    2018-08-30   98.169800
 2    2018-08-31   98.613503
 3    2018-09-03   97.612396
 4    2018-09-04   96.152702
 ...         ...         ...
 1223 2023-08-22  292.064392
 1224 2023-08-23  292.571686
 1225 2023-08-24  291.222107
 1226 2023-08-25  288.174591
 1227 2023-08-28  289.943512

 [1228 rows x 2 columns],
 '0P0000XW4V':            date         nav
 0    2018-08-29   60.523399
 1    2018-08-30   60.518700
 2    2018-08-31   60.759701
 3    2018-09-03   60.364899
 4    2018-09-04   59.703499
 ...         ...         ...
 1223 2023-08-22  172.451706
 1224 2023-08-23  172.381699
 1225 2023-08-24  171.318497
 1226 2023-08-25  170.410294
 1227 2023-08-28  171.585999

 [1228 rows x 2 columns],
 '0P0000XW4E':            date         nav
 0    2018-08-29  188.692993
 1    2018-08-30  189.229004
 2    2018-08-31  190.432007
 3    2018-09-03  188.688004
 4    2018-09-04  186.449005
 ...         ...         ...
 1224 2023-08-22  526.297302
 1225 2023-08-23  529.070679
 1226 2023-08-24  526.710999
 1227 2023-08-25  524.461914
 1228 2023-08-28  527.810730

 [1229 rows x 2 columns]}

In [7]:
i=1
for df in temp_df.values():
    df.rename(columns={'nav':f"nav_{i}"},inplace=True)
    i+=1

In [8]:
temp_df

{'0P0000XW51':            date       nav_1
 0    2018-08-29   98.234497
 1    2018-08-30   98.169800
 2    2018-08-31   98.613503
 3    2018-09-03   97.612396
 4    2018-09-04   96.152702
 ...         ...         ...
 1223 2023-08-22  292.064392
 1224 2023-08-23  292.571686
 1225 2023-08-24  291.222107
 1226 2023-08-25  288.174591
 1227 2023-08-28  289.943512

 [1228 rows x 2 columns],
 '0P0000XW4V':            date       nav_2
 0    2018-08-29   60.523399
 1    2018-08-30   60.518700
 2    2018-08-31   60.759701
 3    2018-09-03   60.364899
 4    2018-09-04   59.703499
 ...         ...         ...
 1223 2023-08-22  172.451706
 1224 2023-08-23  172.381699
 1225 2023-08-24  171.318497
 1226 2023-08-25  170.410294
 1227 2023-08-28  171.585999

 [1228 rows x 2 columns],
 '0P0000XW4E':            date       nav_3
 0    2018-08-29  188.692993
 1    2018-08-30  189.229004
 2    2018-08-31  190.432007
 3    2018-09-03  188.688004
 4    2018-09-04  186.449005
 ...         ...         ...
 1224 2023-08-22  526.297302
 1225 2023-08-23  529.070679
 1226 2023-08-24  526.710999
 1227 2023-08-25  524.461914
 1228 2023-08-28  527.810730

 [1229 rows x 2 columns]}

In [9]:
merge_df=pd.DataFrame()

for df in temp_df.values(): 
    if merge_df.empty:
        merge_df=df
    else:
        merge_df=pd.merge(merge_df,df,on='date',how='left')    
        
        
print(merge_df)

           date       nav_1       nav_2       nav_3
0    2018-08-29   98.234497   60.523399  188.692993
1    2018-08-30   98.169800   60.518700  189.229004
2    2018-08-31   98.613503   60.759701  190.432007
3    2018-09-03   97.612396   60.364899  188.688004
4    2018-09-04   96.152702   59.703499  186.449005
...         ...         ...         ...         ...
1223 2023-08-22  292.064392  172.451706  526.297302
1224 2023-08-23  292.571686  172.381699  529.070679
1225 2023-08-24  291.222107  171.318497  526.710999
1226 2023-08-25  288.174591  170.410294  524.461914
1227 2023-08-28  289.943512  171.585999  527.810730

[1228 rows x 4 columns]

In [10]:
for df in temp_df.values():
    print(df)

           date       nav_1
0    2018-08-29   98.234497
1    2018-08-30   98.169800
2    2018-08-31   98.613503
3    2018-09-03   97.612396
4    2018-09-04   96.152702
...         ...         ...
1223 2023-08-22  292.064392
1224 2023-08-23  292.571686
1225 2023-08-24  291.222107
1226 2023-08-25  288.174591
1227 2023-08-28  289.943512

[1228 rows x 2 columns]
           date       nav_2
0    2018-08-29   60.523399
1    2018-08-30   60.518700
2    2018-08-31   60.759701
3    2018-09-03   60.364899
4    2018-09-04   59.703499
...         ...         ...
1223 2023-08-22  172.451706
1224 2023-08-23  172.381699
1225 2023-08-24  171.318497
1226 2023-08-25  170.410294
1227 2023-08-28  171.585999

[1228 rows x 2 columns]
           date       nav_3
0    2018-08-29  188.692993
1    2018-08-30  189.229004
2    2018-08-31  190.432007
3    2018-09-03  188.688004
4    2018-09-04  186.449005
...         ...         ...
1224 2023-08-22  526.297302
1225 2023-08-23  529.070679
1226 2023-08-24  526.710999
1227 2023-08-25  524.461914
1228 2023-08-28  527.810730

[1229 rows x 2 columns]

In [11]:
merge_df.dtypes

date     datetime64[ns]
nav_1           float64
nav_2           float64
nav_3           float64
dtype: object

In [50]:
merge_df.dtypes

date     datetime64[ns]
nav_1           float64
nav_2           float64
nav_3           float64
nav_4           float64
nav_5           float64
dtype: object

In [13]:
index_df=pd.read_csv(".//data_in//^NSEI.csv")

In [14]:
index_df.drop(columns=['Open','High','Low','Adj Close','Volume'],inplace=True)
index_df['Date']=pd.to_datetime(index_df['Date'])

In [15]:
index_df

           Date         Close
0    2018-08-31  11680.500000
1    2018-09-03  11582.349609
2    2018-09-04  11520.299805
3    2018-09-05  11476.950195
4    2018-09-06  11536.900391
...         ...           ...
1229 2023-08-24  19386.699219
1230 2023-08-25  19265.800781
1231 2023-08-28  19306.050781
1232 2023-08-29  19342.650391
1233 2023-08-30  19347.449219

[1234 rows x 2 columns]

In [16]:
i=1
for i in range(1,4):
    print(merge_df[f"nav_{i}"])

0        98.234497
1        98.169800
2        98.613503
3        97.612396
4        96.152702
           ...
1223    292.064392
1224    292.571686
1225    291.222107
1226    288.174591
1227    289.943512
Name: nav_1, Length: 1228, dtype: float64
0        60.523399
1        60.518700
2        60.759701
3        60.364899
4        59.703499
           ...
1223    172.451706
1224    172.381699
1225    171.318497
1226    170.410294
1227    171.585999
Name: nav_2, Length: 1228, dtype: float64
0       188.692993
1       189.229004
2       190.432007
3       188.688004
4       186.449005
           ...
1223    526.297302
1224    529.070679
1225    526.710999
1226    524.461914
1227    527.810730
Name: nav_3, Length: 1228, dtype: float64

In [18]:
i=1
for i in range(1,4):
    merge_df[f"nav_{i}"]=(merge_df[f"nav_{i}"]/merge_df[f"nav_{i}"][0])*100
index_df['Close_nrml']= (index_df['Close']/index_df['Close'][0])*100

In [19]:
merge_df

           date       nav_1       nav_2       nav_3
0    2018-08-29  100.000000  100.000000  100.000000
1    2018-08-30   99.934140   99.992235  100.284065
2    2018-08-31  100.385817  100.390430  100.921610
3    2018-09-03   99.366719   99.738117   99.997356
4    2018-09-04   97.880791   98.645316   98.810773
...         ...         ...         ...         ...
1223 2023-08-22  297.313470  284.933939  278.917247
1224 2023-08-23  297.829881  284.818269  280.387030
1225 2023-08-24  296.456047  283.061590  279.136490
1226 2023-08-25  293.353760  281.561008  277.944562
1227 2023-08-28  295.154473  283.503571  279.719305

[1228 rows x 4 columns]

In [24]:
merge_df.to_csv("check.csv")
index_df.to_csv('index.csv')

In [20]:
#merge_df['avg']=(merge_df['nav_1'] + merge_df['nav_2'] + merge_df['nav_3'] + merge_df['nav_4'] + merge_df['nav_5'])/5
merge_df['avg']=merge_df[['nav_1','nav_2','nav_3']].mean(axis=1)

In [21]:
merge_df

           date       nav_1       nav_2       nav_3         avg
0    2018-08-29  100.000000  100.000000  100.000000  100.000000
1    2018-08-30   99.934140   99.992235  100.284065  100.070147
2    2018-08-31  100.385817  100.390430  100.921610  100.565952
3    2018-09-03   99.366719   99.738117   99.997356   99.700730
4    2018-09-04   97.880791   98.645316   98.810773   98.445627
...         ...         ...         ...         ...         ...
1223 2023-08-22  297.313470  284.933939  278.917247  287.054886
1224 2023-08-23  297.829881  284.818269  280.387030  287.678393
1225 2023-08-24  296.456047  283.061590  279.136490  286.218043
1226 2023-08-25  293.353760  281.561008  277.944562  284.286444
1227 2023-08-28  295.154473  283.503571  279.719305  286.125783

[1228 rows x 5 columns]